start_message = Салют, { $username }! Ты в PizzaBot 🍕 — мы уже прогрели печь. 🔥
    Нажми «Начать» и выбери язык, чтобы заказать что-то вкусненькое!
start_button = 🚀 Начать
language-changed = Язык переключён на Русский
choose_language = Наше вкусное меню начинается с выбора языка — выбирай! 🍕
save_button = ✅ Сохранить
cancel_button = Отмена
ru = Русский
en = Английский
lang_saved = Язык успешно сохранён!
home_menu = Это наша небольшая менюшка пиццерии. Добро пожаловать! 🍕🍕

menu_button = 🍕 Меню
cart_button = 🛒 Корзина
orders_button = 📦 Мои заказы
settings_button = ⚙️ Настройки
support_button = 📞 Поддержка

add_to_cart = ➕ В корзину
cansel_action = ❌ Отмена
go_to_cart = 🛒 Перейти в корзину

item_added_to_cart = Товар добавлен в корзину! 🛒

order_confirm = ✅ Оформить заказ
clear_cart = 🧹 Очистить корзину

# Для админов
admin_start_message = Привет, { $username }! Вы вошли как администратор.

help_admin = Я бот, созданный для управления магазином. Умею сохранять выбранный язык интерфейса, а также помогаю добавлять товары и обрабатывать заказы.

    Ваша роль — ADMIN, поэтому вам доступен расширенный список команд:

    /add_menu_item – добавить новый товар в меню
    /delete_menu_item – удалить товар из меню
    /orders – посмотреть заказы


cansel_item = '❌ Добавление товара отменено. Если хотите начать заново, введите /add_menu_item'

# Ключи для корзины
cart_is_empty = 🛒 Ваша корзина пуста
your_cart = 🛒 Ваша корзина
total = Итого
item_removed_from_cart = Товар удалён из корзины
item_not_found_in_cart = Товар не найден в корзине
quantity_updated = Количество обновлено
failed_to_update_quantity = Не удалось обновить количество
cart_cleared = Корзина очищена!
cart_already_empty = Корзина уже пуста


confirm_order_button = ✅ Оформить заказ
order_confirmed_alert = Заказ успешно оформлен!
order_confirmed_text = Заказ подтверждён! Номер: { $order_id }

start_payment = 💰 Начать оплату

pay_now = Оплатить заказ
order_payment = Оплата заказа
order_title = Заказ в пиццерии
order_description = Оплата вашего заказа
payment_success = ✅ Оплата прошла успешно! Спасибо за заказ 🙌



start_description = Запустить бота
lang_description = Изменить язык
help_description = Справка

ban_description = Заблокировать пользователя
unban_description = Разблокировать пользователя
statistics_description = Показать статистику


empty_ban_answer = ❗ Укажите ID или username пользователя.
incorrect_ban_arg = ⚠ Неверный формат аргумента. Используйте /ban <id> или /ban @username.
no_user = 🚫 Пользователь не найден.
already_banned = 🔒 Этот пользователь уже заблокирован.
successfully_banned = ✅ Пользователь успешно заблокирован.

empty_unban_answer = ❗ Укажите ID или username пользователя.
incorrect_unban_arg = ⚠ Неверный формат аргумента. Используйте /unban <id> или /unban @username.
already_unbanned = ⚙ Этот пользователь не заблокирован.
successfully_unbanned = ✅ Пользователь успешно разблокирован.